#### 数据透视表

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('./titanic/train.csv')

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [11]:
#默认值就是求平均值
df_pivot = df.pivot_table(index = 'Sex', columns= 'Pclass', values='Fare')

In [12]:
df_pivot

Pclass           1          2          3
Sex
female  106.125798  21.970121  16.118810
male     67.226127  19.741782  12.661633

In [21]:
df_pivot = df.pivot_table(index = 'Sex', columns= 'Pclass', values='Fare', aggfunc='count')

In [22]:
df_pivot

Pclass    1    2    3
Sex
female   94   76  144
male    122  108  347

In [26]:
df.value_counts('Sex')

Sex
male      577
female    314
dtype: int64

In [28]:
pd.crosstab(index = df['Sex'], columns=df['Pclass'])

Pclass    1    2    3
Sex
female   94   76  144
male    122  108  347

In [34]:
df_pivot = df.pivot_table(index = 'Sex', columns= 'Pclass', values='Survived')
df_pivot

Pclass         1         2         3
Sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [35]:
df['Underaged'] = df['Age'] < 18

In [36]:
df_pivot = df.pivot_table(index = 'Sex', columns= 'Underaged', values='Survived')
df_pivot

Underaged     False      True
Sex
female     0.752896  0.690909
male       0.165703  0.396552